# Brain Stoke analysis with SQL

## About the Dataset

A stroke is a medical condition in which poor blood flow to the brain causes cell death. There are two main types of stroke: ischemic, due to lack of blood flow, and hemorrhagic, due to bleeding. Both cause parts of the brain to stop functioning properly. Signs and symptoms of a stroke may include an inability to move or feel on one side of the body, problems understanding or speaking, dizziness, or loss of vision to one side. Signs and symptoms often appear soon after the stroke has occurred. If symptoms last less than one or two hours, the stroke is a transient ischemic attack (TIA), also called a mini-stroke. A hemorrhagic stroke may also be associated with a severe headache. The symptoms of a stroke can be permanent. Long-term complications may include pneumonia and loss of bladder control.  

The main risk factor for stroke is high blood pressure. Other risk factors include high blood cholesterol, tobacco smoking, obesity, diabetes mellitus, a previous TIA, end-stage kidney disease, and atrial fibrillation. An ischemic stroke is typically caused by blockage of a blood vessel, though there are also less common causes. A hemorrhagic stroke is caused by either bleeding directly into the brain or into the space between the brain's membranes. Bleeding may occur due to a ruptured brain aneurysm. Diagnosis is typically based on a physical exam and is supported by medical imaging such as a CT scan or MRI scan. A CT scan can rule out bleeding, but may not necessarily rule out ischemia, which early on typically does not show up on a CT scan. Other tests such as an electrocardiogram (ECG) and blood tests are done to determine risk factors and rule out other possible causes. Low blood sugar may cause similar symptoms.  

Prevention includes decreasing risk factors, surgery to open up the arteries to the brain in those with problematic carotid narrowing, and warfarin in people with atrial fibrillation. Aspirin or statins may be recommended by physicians for prevention. A stroke or TIA often requires emergency care. An ischemic stroke, if detected within three to four and half hours, may be treatable with a medication that can break down the clot. Some hemorrhagic strokes benefit from surgery. Treatment to attempt recovery of lost function is called stroke rehabilitation, and ideally takes place in a stroke unit; however, these are not available in much of the world.

### Attribute Information

1. gender: "Male", "Female" or "Other"
2. age: Age of the patient
3. hypertension: 0 if the patient doesn't have hypertension, 1 if the patient has hypertension
4. heart disease: 0 if the patient doesn't have any heart diseases, 1 if the patient has a heart disease
5. ever-married" "Yes" or "No"
6. worktype: "children", "Govtjob", "Neverworked", "Private" or "Self-employed"
7. residenceType: "Rural" or "Urban"
8. avgGlucoseLevel: average glucose level in blood
9. bmi: body mass index
10. smoking_status: "formerly smoked", "never smoked", "smokes" or "Unknown"
11. stroke: 1 if the patient had a stroke or 0 if not.

[Dataset link](https://www.kaggle.com/datasets/jillanisofttech/brain-stroke-dataset?sort=most-comments)

#### Step 1: Importing the required modules

In [2]:
import pandas as pd
import sqlite3 as sq

#### Checking at the dataset

In [3]:
data= pd.read_csv('brain_stroke.csv')
data.head()

,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
2,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
3,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
4,Male,81.0,0,0,Yes,Private,Urban,186.21,29.0,formerly smoked,1

#### Step 2: Creating a Database

In [4]:
# Create the database
conn= sq.connect('brain_stroke.db')

# Create a table called brainStroke
query= """
CREATE TABLE brainStroke(
    gender VARCHAR(10),
    age DECIMAL(3,1),
    hypertension SMALLINT,
    heartDisease SMALLINT,
    ever_married VARCHAR(5),
    work_type VARCHAR(20),
    residence VARCHAR(15),
    avg_glucose_level DECIMAL(4,3),
    bmi DECIMAL(4,3),
    smoking_status VARCHAR(15),
    stroke SMALLINT
)
"""

# Connect with the database
with conn:
    cur= conn.cursor()
    cur.execute("DROP TABLE IF EXISTS brainStroke")
    cur.execute(query)

In [5]:
# check SQLite master for confirmation

query= "SELECT name FROM sqlite_master WHERE type='table'"
cur.execute(query)
cur.fetchall()

[('brainStroke',)]

#### Step 3: Converting the observations to tuples

In [6]:
data_tuple= tuple(data.itertuples(index= False, name= None))
#Display the first observation in form of a tuple

data_tuple[0]

('Male',
 67.0,
 0,
 1,
 'Yes',
 'Private',
 'Urban',
 228.69,
 36.6,
 'formerly smoked',
 1)

#### Step 4: Inserting the converted tuples as values in the database table

In [7]:
query= "INSERT INTO brainStroke VALUES(?,?,?,?,?,?,?,?,?,?,?)"#The nunber of question marks should be the same as
#the number of columns in the dataset

cur.executemany(query, data_tuple)

The above message indicates that the operation was successful.

#### Step 5: Write a Query to display the created table

In [8]:
query= """
SELECT * FROM brainStroke
LIMIT 5
"""
pd.read_sql_query(query, conn)

,gender,age,hypertension,heartDisease,ever_married,work_type,residence,avg_glucose_level,bmi,smoking_status,stroke
0,Male,67,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,Male,80,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
2,Female,49,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
3,Female,79,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1
4,Male,81,0,0,Yes,Private,Urban,186.21,29.0,formerly smoked,1

### Questions
1. What's the distribution of gender in the dataset?
2. What's the distribution of stroke in the dataset?
3. What's the distribution of brain stroke by gender?
4. For women, how many percent has stroke?
5. For men, how many percent has no stroke?
6. Details of the oldest people with stroke
7. How many people are married and has stroke?
8. How many people are not married and has stroke?
9. What's the minimum, average and maximum age in the data?

1. What's the distribution of gender in the dataset?

In [9]:
query= """
SELECT  gender,COUNT(*) AS count
FROM    brainStroke
GROUP BY gender
"""
pd.read_sql_query(query, conn)

   gender  count
0  Female   2907
1    Male   2074

2. What's the distribution of stroke in the dataset?

In [10]:
query= """
SELECT stroke, count(*) count
from brainStroke
group by stroke
"""
pd.read_sql_query(query, conn)

   stroke  count
0       0   4733
1       1    248

3. What's the distribution of brain stroke by gender?

In [11]:
query= """
SELECT gender,stroke, COUNT(*) AS count
FROM brainStroke
GROUP BY stroke,gender
"""
pd.read_sql_query(query, conn)

   gender  stroke  count
0  Female       0   2767
1    Male       0   1966
2  Female       1    140
3    Male       1    108

4. For women, how many percent has stroke?

In [12]:
query = """
SELECT gender,stroke, CAST(COUNT(*) AS FLOAT)/total.count*100 AS Percentage
FROM brainStroke, (SELECT COUNT(*) count FROM brainStroke WHERE gender='Female') total
WHERE gender='Female'
GROUP BY stroke
"""
pd.read_sql_query(query, conn)

   gender  stroke  Percentage
0  Female       0   95.184039
1  Female       1    4.815961

5. For men, how many percent has no stroke?

In [13]:
query= """
SELECT gender, stroke,CAST(COUNT(*) AS FLOAT)/total.count*100 AS PERCENTAGE
FROM brainStroke, (SELECT COUNT(*) count FROM brainStroke WHERE gender= 'Male') total
WHERE gender='Male'
GROUP BY stroke
"""
pd.read_sql_query(query, conn)

  gender  stroke  PERCENTAGE
0   Male       0   94.792671
1   Male       1    5.207329

6. Details of the oldest people with stroke

In [14]:
query= """
WITH old_people AS (
    SELECT *
    FROM brainStroke
    WHERE age>70 
)

SELECT gender, work_type, COUNT(*) count
FROM old_people
GROUP BY gender, work_type
"""
pd.read_sql_query(query, conn)

   gender      work_type  count
0  Female       Govt_job     52
1  Female        Private    193
2  Female  Self-employed    175
3    Male       Govt_job     31
4    Male        Private    143
5    Male  Self-employed    113

7. How many people are married and has stroke?

In [15]:
query= """
SELECT ever_married, stroke, COUNT(*) count
FROM brainStroke
WHERE ever_married= 'Yes' AND stroke= 1
-- GROUP BY ever_married, stroke
"""
pd.read_sql_query(query, conn)

  ever_married  stroke  count
0          Yes       1    219

8. How many people are not married and has stroke?

In [16]:
query= """
SELECT ever_married, stroke, COUNT(*) count
FROM brainStroke
-- WHERE ever_married= 'No' AND stroke= 1
GROUP BY ever_married, stroke
"""
pd.read_sql_query(query, conn)

  ever_married  stroke  count
0           No       0   1672
1           No       1     29
2          Yes       0   3061
3          Yes       1    219

9. What's the minimum, average and maximum age in the data?

In [17]:
query="""
SELECT
    MIN(age) minimum_age,
    AVG(age) avg_age,
    MAX(age) max_age
FROM brainStroke
"""
pd.read_sql_query(query,conn)

   minimum_age    avg_age  max_age
0         0.08  43.419859       82

In [18]:
query= """
SELECT *
    -- COUNT(*) count
FROM brainStroke
WHERE age<1
LIMIT 10
"""
pd.read_sql_query(query, conn)

,gender,age,hypertension,heartDisease,ever_married,work_type,residence,avg_glucose_level,bmi,smoking_status,stroke
0,Female,0.64,0,0,No,children,Urban,83.82,24.9,Unknown,0
1,Female,0.88,0,0,No,children,Rural,88.11,15.5,Unknown,0
2,Female,0.32,0,0,No,children,Rural,73.71,16.2,Unknown,0
3,Male,0.88,0,0,No,children,Rural,157.57,19.2,Unknown,0
4,Male,0.24,0,0,No,children,Rural,118.87,16.3,Unknown,0
5,Female,0.32,0,0,No,children,Rural,55.86,16.0,Unknown,0
6,Female,0.72,0,0,No,children,Urban,66.36,23.0,Unknown,0
7,Male,0.80,0,0,No,children,Rural,98.67,17.5,Unknown,0
8,Male,0.40,0,0,No,children,Urban,109.56,14.3,Unknown,0
9,Female,0.08,0,0,No,children,Urban,139.67,14.1,Unknown,0

## TASK

1. What's the distibution of hypertension in the dataset?
2. How many male, and female has hypertension?
3. For each smoking status show how many people have hypertension and how many do not?
4. How many male, and female has both hypertension and heart disease?
5. Which residence has the lowest number of people with no heart disease?
6. How many percent of people with private work type has no hypertension?

#### SOLUTIONS

1. What's the distibution of hypertension in the dataset?

In [19]:
question1= """
SELECT
    hypertension,
    COUNT(*) count
FROM brainStroke
GROUP BY hypertension    
"""
pd.read_sql_query(question1, conn)

   hypertension  count
0             0   4502
1             1    479

2. How many male, and female has hypertension?

In [20]:
query= """
SELECT gender, hypertension, COUNT(*) count
FROM brainStroke
WHERE hypertension = 1
GROUP BY gender
"""
pd.read_sql_query(query, conn)

   gender  hypertension  count
0  Female             1    264
1    Male             1    215

3. For each smoking status show how many people have hypertension and how many do not?

In [21]:
query= """
SELECT
    smoking_status,
    hypertension,
    COUNT(*) count
FROM brainStroke
WHERE smoking_status='formerly smoked'
GROUP BY hypertension
UNION
SELECT
    smoking_status,
    hypertension,
    COUNT(*) count
FROM brainStroke
WHERE smoking_status='never smoked'
GROUP BY hypertension
UNION
SELECT
    smoking_status,
    hypertension,
    COUNT(*) count
FROM brainStroke
WHERE smoking_status='smokes'
GROUP BY hypertension
"""
pd.read_sql_query(query, conn)

    smoking_status  hypertension  count
0  formerly smoked             0    752
1  formerly smoked             1    115
2     never smoked             0   1615
3     never smoked             1    223
4           smokes             0    685
5           smokes             1     91

In [22]:
### Practice
### Not in the assignment
query="""
WITH smoking_hypertension AS(
    SELECT
        smoking_status,
        hypertension,
        COUNT(*) count
    FROM brainStroke
    WHERE smoking_status='formerly smoked'
    GROUP BY hypertension
    UNION
    SELECT
        smoking_status,
        hypertension,
        COUNT(*) count
    FROM brainStroke
    WHERE smoking_status='never smoked'
    GROUP BY hypertension
    UNION
    SELECT
        smoking_status,
        hypertension,
        COUNT(*) count
    FROM brainStroke
    WHERE smoking_status='smokes'
    GROUP BY hypertension
)

SELECT SUM(count) 
FROM smoking_hypertension
"""
pd.read_sql_query(query, conn)

   SUM(count)
0        3481

In [23]:
#Practice
trial= """
SELECT COUNT(*) count
FROM brainStroke
"""
pd.read_sql_query(trial, conn)

   count
0   4981

4. How many male, and female has both hypertension and heart disease?

In [24]:
query= """
SELECT gender,
hypertension,
heartdisease, 
COUNT(*) AS count
FROM brainStroke
WHERE hypertension = 1 AND heartdisease = 1
GROUP BY gender
LIMIT 5
"""
pd.read_sql_query(query, conn)

   gender  hypertension  heartDisease  count
0  Female             1             1     29
1    Male             1             1     35

5. Which residence has the lowest number of people with no heart disease?

In [25]:
query= """
SELECT residence, COUNT(*) count
FROM brainStroke
GROUP BY residence
"""
pd.read_sql_query(query, conn)

  residence  count
0     Rural   2449
1     Urban   2532

6. How many percent of people with private work type has no hypertension?

In [26]:
query= """
SELECT
    work_type, 
    hypertension,
    CAST(COUNT(*) AS FLOAT)/total.count*100 AS Percent
FROM brainStroke, (SELECT COUNT(*) count
                    FROM brainStroke
                    WHERE work_type='Private') total
WHERE work_type='Private'
GROUP BY hypertension
UNION
SELECT
    work_type, 
    hypertension,
    CAST(COUNT(*) AS FLOAT)/total.count*100 AS Percent
FROM brainStroke, (SELECT COUNT(*) count
                    FROM brainStroke
                    WHERE work_type='children') total
WHERE work_type='children'
GROUP BY hypertension
"""
pd.read_sql_query(query, conn)

  work_type  hypertension    Percent
0   Private             0   90.48951
1   Private             1    9.51049
2  children             0  100.00000

In [30]:
query= """
SELECT COUNT(*) count
FROM brainStroke
WHERE work_type='children' AND hypertension= 0
"""
pd.read_sql_query(query,conn)

   count
0    673